include
```c++
#include <iostream>


using namespace std;
char format[] = "%s";
char iptr[] = "i";
char str1[] = "Hello";
char str2[] = "world";
char pobeda[] = "Ура";
char nepobeda[] = "Эх";
char _ch;
```



// task1
	5.1 Написать программу, копирующую содержимое одной строки в другую строку(длина строки - приемника не м.б.меньше строки - источника).
```c++
char str1[] = "Hello";
char str2[] = "world";
    _asm {
        cld;
        lea esi, str1;
        lea edi, str2;
        mov ecx, 10
        rep movs str2, str1;
        lea eax, str1;
        push eax;
        call printf;
        pop eax;
    }
```

// task2
	5.2 Написать программу, копирующую содержимое одного массива в другой массив данных типа int(int – 32 бита, т.е.двойное слово).
```c++
void print(int arr[])
{
    for (int i = 0; i < 6; i++)
    {
        cout << arr[i] << " ";
    }
    cout << endl;
}
int _array[6] = { 0,1,2,3,4,5 };
int _array2[6] = { 2,6,7,8,9,0 };
int n = 6;
_asm {
    cld;
    mov ecx, n;//кол-во элементов
    lea esi, _array;
    lea edi, _array2;
    mov ecx, 6
        rep movs _array2, _array;
    lea eax, _array2;
    push eax;
    call print;
    pop eax;
    lea eax, _array;
    push eax;
    call print;
    pop eax;
}
```

// task3
	5.3 Написать программу, копирующую подстроку длиной n с i - ой позиции из исходной строки s1 в строку s2(i начинается с нуля).
```c++
_asm {
    mov esi, offset str2 + 2 //с какой позиции начать
    lea edi, str1;
    ;mov eax, esi;

    mov ecx, 3; //длинна подстроки
    rep movs str2, str1;
    lea eax, str1;
    push eax;
    call printf;
    pop eax;

    lea eax, str2;
    push eax;
    call printf;
    pop eax;
    }

```

// task4
    5.4 Написать программу, возвращающую:
    -1 вариант : позицию, на которой в строке находится введенный символ;
    -2 вариант: количество совпадений значений элементов целочисленного
      массива со введенным пользователем значением.
```c++
cout << "Ввседите символ" << endl;
cin >> _ch;
    _asm {
        cld
        lea edi, str1;//строка
        mov al, _ch;
        mov ecx, 5;
        repne scas str1;//выход при первом обнаружении
        je found;
        lea eax, nepobeda;
        push eax;
        call printf;
        pop eax;
        jmp end1
        found:
            lea eax, pobeda;
            push eax;
            call printf;
            pop eax;
        end1:
```